@ewbankkit We are seeing it on new deployments. during the apply it doesnt show a container task definition in the resource

```hcl
  # module.container_ui[0].aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "example"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "example"
        }
      + tags_all                 = {
          + "Environment"     = "development"
          + "EnvironmentName" = "DW037"
          + "Name"            = "example"
          + "Owner"           = "example"
          + "Pipeline"        = "https://example.com/devops-terraform-modules/example/-/pipelines/130717"
          + "Terraform"       = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }
```

If we replay this CI job, then it does go ahead and redeploy the resources successfully and the apply shows the container_defs on the second run

```hcl 
# module.container_ui[0].aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + Command                = null
                  + Cpu                    = 0
                  + CredentialSpecs        = null
                  + DependsOn              = null
                  + DisableNetworking      = null
...
...
...
                 + VolumesFrom            = null
                  + WorkingDirectory       = null
                },
            ]
        )
      + cpu                      = "256"
...
```